trade_exp/src/InformationRegisters/СтавкиНДСНоменклатуры/СтавкиНДСНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="12798d99-42e0-4eb6-9005-a7e4d1d47ac0">
  <name>СтавкиНДСНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="b10ade8d-4180-4279-975c-8bfdd3ef50aa">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d9ec4c25-d8fd-488c-b607-3f0eeb047003">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a883da31-c798-4b38-b4fb-d5eef84ab3fd">
    <name>Страна</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатурыПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b32fa380-1610-4fb8-bfc7-02c958ebe249">
    <name>ВидЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ВидыЦенПоставщиков/ВидыЦенПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыЦенПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="3c2f91fc-45cd-43e2-aa03-0f0e242a13c1">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10d3d44e-e5fe-448d-bbbc-8dcde99350a8">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de6c3fd2-3216-4234-a824-1aeeb7c16572">
    <name>ДоступноДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8697945-c58b-4cef-bbf8-1e8bd9b57e41">
    <name>ДоступноДляПродажиКлиентам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8f2e4c9-3ceb-4266-a8c6-a74d7b367b76">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="06c0866a-4510-4290-943d-3850b5245d36">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3371f83-b09a-4198-bc28-7a2aed51b386">
    <name>РегионПрисутствия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="763d01e8-ea69-4acd-b052-c945b77d303c">
    <name>ФорматПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/СоглашенияСПоставщиками/СоглашенияСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоглашенияСПоставщиками</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="609d8853-a131-4494-871e-8abd42985f92">
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e21f800-8d3b-4d90-a190-277b2319190b">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="43ca8ac0-d4ca-475e-ba51-1569ee2bbbae">
    <name>УдержатьВознаграждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31cdbdb8-359c-4f71-a135-6c3a2c5874db">
    <name>СрокПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5ca57de8-09c1-4314-9bb4-4b1b63163b4f">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6e0c6866-5f68-4324-8f5d-38f0451b5469">
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d00c58e-1a6b-403d-b830-71ad4be71e1a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="533065e2-220d-483d-807c-4e65d42ea8e7">
    <name>ВидЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a3ef8e2-7143-4519-9341-f17c1f6f00ce">
    <name>ПроцентВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="50ae241a-118c-4af9-9540-86d81408bf01">
    <name>КалендарьВозвратаТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f19294c-4121-4ea2-bb3b-790800632adb">
    <name>ВозвращатьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4174e056-fa55-4559-a3bc-ac9ff3abaf7c">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7866a9c3-144b-44cf-9c87-808c1bd11901">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dffc9f6b-cea2-49a6-9a60-b634c2903829">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="751c2bab-805e-459d-be9b-040b9017c817">
    <name>КонтролироватьЦеныЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="841ef26b-63a4-403e-81e4-82a923b9ba5a">
    <name>СпособРасчетаВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23cd103f-de4e-4752-8300-9bb47b112ebc">
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ccb588b6-18db-4d06-9cd7-03b327d99b1a">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0c126876-dc7a-45a5-a1cf-19b3a0604218">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b05926f0-37a0-4a7f-ac09-a252b6ef4b61">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="643dccba-8181-4fa7-bf4a-407f1a8daff1">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83d97d9c-9ba9-463a-9b34-04378d0edeb8">
    <name>ПроцентРучнойСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9934bd5c-22cd-4b1f-a99c-4b9e67875f74">
    <name>АдресДоставкиДляПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac731b5c-84b1-4e31-abda-1a638a9fe256">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c9adf11-4791-471c-af03-393d78159ce6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcaa3e11-1c8a-44fc-ae6d-b5ce6f0bcf87">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e591e91-de4e-426e-8a14-4b57f0ebb418">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a7be107-9577-466b-b929-208af63b6852">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2742ff2e-869c-4984-8c0f-9da5fea9ce0c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="90bed2cb-fcc4-4d5d-8e4e-2de80a8e0d80">
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55f97e97-8cae-4236-8f12-097298c936a3">
    <name>СрокПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d6c80072-d137-4b35-a7e5-85bb837e9464">
    <name>СрокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da1a6c73-b3e2-4b02-a8b0-4949d9efdfca">
    <name>МинимальнаяСуммаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a8f3de0-e9d4-4cb7-9db6-b695f2c7f4a4">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3492dbe-c7b6-4622-8ac4-7690b6fa2d0c">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b9973621-c5bd-4c2d-9e9a-024b94f82a43">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89c57c55-7cc5-486b-b2d6-67e9d26f0554">
    <name>ПроцентРучнойНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5ff425f5-d8e0-410d-a5dd-5f74be08684f">
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03a3a9bc-cd4c-4ef8-8249-299eb14e94ee">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b0c866d-14d5-4e4e-bc85-a3015c89f2fb">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24ac0c6d-45a3-4ca3-b79e-5617b6204b6e">
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adda1cd4-0f3e-41f2-ac72-60d4650f8468">
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="209b95b6-cf62-438d-86ac-465e0ca30862">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="832ffb2a-f09e-4cac-ad6a-402504b1ac77">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4cc1e45a-7de2-4d83-afc0-6761b10dd5d6">
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b50946ec-c5b5-445d-9c0d-d455aff9f373">
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="568853d5-6056-436d-a9b3-e3e145360710">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="43af7c65-cdc6-4290-8017-110f674e8d3d">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/ЦеныПредприятияЗаполнениеСервер/Module.bsl
#Область НовоеЦенообразование

Функция ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению_НЦ(ИмяТаблицы, ИмяВременнойТаблицыТоваров)
	
	ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	               |	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВременнаяТаблицаТовары.Характеристика КАК Характеристика,
	               |	ВременнаяТаблицаТовары.Упаковка КАК Упаковка,
	               |	ВременнаяТаблицаТовары.Валюта КАК Валюта,
	               |	&СтавкаНДС КАК СтавкаНДС,
	               |	&ПолеВидаЦен КАК ВидЦены,
	               |	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(СоглашениеТовары.Цена, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1) * ВЫБОР
	               |		КОГДА ВременнаяТаблицаТовары.Валюта <> СоглашениеШапка.Валюта
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
	               |						ТОГДА КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель)
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СоглашениеТовары.СрокПоставки, 0) > 0
	               |			ТОГДА СоглашениеТовары.СрокПоставки
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(СоглашениеЦеновыеГруппы.СрокПоставки, 0) > 0
	               |					ТОГДА СоглашениеЦеновыеГруппы.СрокПоставки
	               |				ИНАЧЕ СоглашениеШапка.СрокПоставки
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СрокПоставки,
	               |	ВидыЦен.Ссылка КАК ВидЦеныСоглашение,
	               |	ВидыЦенТовары.Ссылка КАК ВидЦеныТовары,
	               |	ВидыЦенЦеновыеГруппы.Ссылка КАК ВидЦеныЦеновыеГруппы
	               |ПОМЕСТИТЬ ИмяТаблицы
	               |ИЗ
	               |	&ИмяВременнойТаблицыТоваров КАК ВременнаяТаблицаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
	               |			ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
	               |				И (ВидыЦенТовары.ФорматПодразделения = &ФорматПодразделения)
	               |				И (ВидыЦенТовары.РегионПрисутствия = &регионПрисутствия)
	               |		ПО (СоглашениеТовары.Ссылка = &Соглашение)
	               |			И ВременнаяТаблицаТовары.Номенклатура = СоглашениеТовары.Номенклатура
	               |			И ВременнаяТаблицаТовары.Характеристика = СоглашениеТовары.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	               |		ПО (СоглашениеШапка.Ссылка = &Соглашение)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО (СправочникНоменклатура.Ссылка = ВременнаяТаблицаТовары.Номенклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
	               |			ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
	               |				И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
	               |				И (ВидыЦенЦеновыеГруппы.РегионПрисутствия = &регионПрисутствия)
	               |		ПО (СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка)
	               |			И (СправочникНоменклатура.Ссылка.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыСрезПоследнихВалютаДокумента
	               |		ПО (КурсыСрезПоследнихВалютаДокумента.Валюта = ВременнаяТаблицаТовары.Валюта)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыСрезПоследнихВалютаСоглашения
	               |		ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = СоглашениеШапка.Валюта)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(
	               |				&Дата,
	               |				(Страна = &СтранаРегистрации
	               |					ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							Т.Номенклатура
	               |						ИЗ
	               |							&ИмяВременнойТаблицыТоваров КАК Т)) КАК СтавкиНДСНоменклатуры
	               |		ПО ВременнаяТаблицаТовары.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Дата, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	               |		ПО (СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен)
	               |			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	               |			И (ВидыЦен.РегионПрисутствия = &регионПрисутствия)
					|;
					|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ИмяТаблицы", "ПОМЕСТИТЬ " + ИмяТаблицы);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяВременнойТаблицыТоваров", ИмяВременнойТаблицыТоваров);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&СтавкаНДС",
		УчетНДСУП.ТекстЗапросаСтавкаНДС(
			"&НалогообложениеНДС",
			"ВременнаяТаблицаТовары.Номенклатура",
			"&ВозвращатьМногооборотнуюТару"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ВременнаяТаблицаТовары.Упаковка",
			"ВременнаяТаблицаТовары.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"СоглашениеТовары.Упаковка",
			"СоглашениеТовары.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ПолеВидаЦен",
	ПолеВидаЦены());
	Возврат ТекстЗапроса
	
КонецФункции


Функция ПолеВидаЦены(тип=1) экспорт
    если тип=1 тогда
	Поле =
	" 		ВЫБОР
	|			КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			КОГДА СоглашениеТовары.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					И СоглашениеТовары.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|				ТОГДА ВидыЦенТовары.Ссылка
	|			КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|					И СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|					И СоглашениеЦеновыеГруппы.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|			КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|					И (СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ NULL
	|						ИЛИ СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка))
	|					И СоглашениеШапка.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ТОГДА ВидыЦен.Ссылка
	|		КОНЕЦ ";    
иначеесли тип =2 тогда
	Поле =
	" 		ВЫБОР
	|		КОГДА ЕСТЬNULL(ВидыЦенТовары.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенТовары.Ссылка
	|		КОГДА ЕСТЬNULL(ВидыЦенЦеновыеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|		ИНАЧЕ ЕСТЬNULL(&ВидЦенСоглашение, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|	КОНЕЦ ";
	конецесли;
	возврат поле;

КонецФункции // ПолеВидаЦены()

Функция ПолучитьЦенуПартнера(Объект) экспорт
	
	если ДопМодуль.НовоеЦенообразованиеЗакупа(Объект.дата) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦенПоставщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
		|		ПО ВидыЦенПоставщиков.ГруппаВидовЦен = СоглашенияСПоставщиками.ГруппаВидовЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО ВидыЦенПоставщиков.РегионПрисутствия = СтруктураПредприятия.РегионПрисутствия
		|			И ВидыЦенПоставщиков.ФорматПодразделения = СтруктураПредприятия.ФорматПодразделения
		|ГДЕ
		|	СоглашенияСПоставщиками.Ссылка = &Соглашение
		|	И СтруктураПредприятия.Ссылка = &Подразделение
		|	И ВидыЦенПоставщиков.Владелец = &Партнер";
		
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		если ВыборкаДетальныеЗаписи.Следующий() тогда
			возврат ВыборкаДетальныеЗаписи.Ссылка;
		Конецесли;
		
	иначе         
		возврат Объект.Соглашение.ВидЦеныПоставщика;
	конецесли;
	
КонецФункции // ПолучитьЦенуПартнера()

Функция ЗаполнитьЦеныПоЦенамПоставщиков(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыЗаполнения, СтруктураДействий = Неопределено, КэшированныеЗначения = Неопределено) Экспорт
	
	ЦеныЗаполнены = Ложь;
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметры заполнения не указаны'");
	КонецЕсли;
	
	// Получение структуры параметров по умолчанию
	Параметры = Новый Структура(
		"ПоляЗаполнения,  ДругиеИменаКолонок",
		"Цена", Новый Структура);
	ОбщегоНазначенияУТКлиентСервер.ДополнитьСтруктуру(Параметры, ПараметрыЗаполнения, Истина);
	
	// Получение выгрузки по табличной части
	Таблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		ТабличнаяЧасть,
		ВыделенныеСтроки,
		"НомерСтроки, Номенклатура",
		Неопределено,
		Параметры.ДругиеИменаКолонок);
	
	// Получение запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Регион", Параметры.Регион);
 	Запрос.УстановитьПараметр("ГруппаВидовЦен", Константы.ГруппаВидовЦенДляСклада.Получить());

	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Номерстроки КАК Номерстроки,
	               |	Таблица.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВР_Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_Таблица.Номерстроки КАК Номерстроки,
	               |	ВР_Таблица.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ЦеныНоменклатурыПоставщиков.Период) КАК Период
	               |ПОМЕСТИТЬ ВР_ЗаписиЦен
	               |ИЗ
	               |	ВР_Таблица КАК ВР_Таблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
	               |		ПО ВР_Таблица.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
	               |			И (ЦеныНоменклатурыПоставщиков.Период <= &Дата)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.РегионПрисутствия = &Регион)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.ГруппаВидовЦен = &ГруппаВидовЦен)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВР_Таблица.Номерстроки,
	               |	ВР_Таблица.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ЗаписиЦен.Номерстроки КАК Номерстроки,
	               |	ВР_ЗаписиЦен.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Цена, 0) КАК Цена
	               |ИЗ
	               |	ВР_ЗаписиЦен КАК ВР_ЗаписиЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
	               |		ПО ВР_ЗаписиЦен.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
	               |			И ВР_ЗаписиЦен.Период = ЦеныНоменклатурыПоставщиков.Период
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.РегионПрисутствия = &Регион)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.ГруппаВидовЦен = &ГруппаВидовЦен)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура(Параметры.ПоляЗаполнения);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
		СтрокаТЧ = ТабличнаяЧасть[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		Если СтруктураДействий <> Неопределено Тогда
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьЦены")
Функция Док_ЗаполнитьЦены(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыЗаполнения, СтруктураДействий)

	ЦеныЗаполнены = Ложь;

	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ПараметрыЗаполнения.Дата);

	Если ПараметрыЗаполнения = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметры заполнения не указаны'");
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	КэшированныеЗначения = Неопределено;

	ИмяКолонкиУпаковка = "Упаковка";
	Если ПараметрыЗаполнения.Свойство("ИмяКолонкиУпаковка") Тогда
		ИмяКолонкиУпаковка = ПараметрыЗаполнения.ИмяКолонкиУпаковка;
	КонецЕсли;

	// Получение структуры параметров по умолчанию
	Параметры = НовыйПараметрыЗаполненияЗаполнитьЦены();
	ОбщегоНазначенияУТКлиентСервер.ДополнитьСтруктуру(Параметры, ПараметрыЗаполнения, Истина);

	// Проверки входящих данных
	Если Не ЗначениеЗаполнено(Параметры.Соглашение) И Не ЗначениеЗаполнено(Параметры.ВидЦены) И Не ЗначениеЗаполнено(Параметры.Партнер) Тогда
		Возврат ЦеныЗаполнены;
	ИначеЕсли Не ЗначениеЗаполнено(Параметры.Валюта) Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	НаличиеКолонокТаблицы = НаличиеКолонокТаблицы(ТабличнаяЧасть,
	"КоличествоУпаковок,
	|КодСтроки,
	|ЗаказКлиента,
	|Серия,
	|Цена,
	|ВидЦены");

	ДополнительныеКолонки  = "";
	ЕстьКоличествоУпаковок = НаличиеКолонокТаблицы.КоличествоУпаковок;
	ЕстьСерия = НаличиеКолонокТаблицы.Серия;
	ЕстьКодСтроки = НаличиеКолонокТаблицы.КодСтроки И НаличиеКолонокТаблицы.ЗаказКлиента;
	ЕстьЦена = НаличиеКолонокТаблицы.Цена;
	ЕстьВидЦены = НаличиеКолонокТаблицы.ВидЦены;

	Если ЕстьКоличествоУпаковок Тогда
		ДополнительныеКолонки = ?(Параметры.РассчитыватьНаборы, "," + "Количество, КоличествоУпаковок, НоменклатураНабора, ХарактеристикаНабора", "");
	Иначе
		ДополнительныеКолонки = ?(Параметры.РассчитыватьНаборы, "," + "Количество, НоменклатураНабора, ХарактеристикаНабора", "");
	КонецЕсли;

	Если ЕстьСерия Тогда
		ДополнительныеКолонки = ""+ ДополнительныеКолонки + ", Серия";
	КонецЕсли;

	// Получение выгрузки по табличной части
	Таблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
	ТабличнаяЧасть,
	ВыделенныеСтроки,
	"НомерСтроки, Номенклатура, Характеристика, " + ИмяКолонкиУпаковка + ДополнительныеКолонки,
	Параметры.КолонкиПоЗначению,
	Параметры.ДругиеИменаКолонок);

	МаксимальныйИндексСтроки = 0;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		Если СтрокаТЧ.НомерСтроки > МаксимальныйИндексСтроки Тогда
			МаксимальныйИндексСтроки = СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;

	КоэффициентыПропорциональностиРасчетаЦенНаборов = Неопределено;
	ДанныеПоКоличествуНаборов = Неопределено;
	Если Параметры.РассчитыватьНаборы Тогда

		Если НЕ ЕстьКоличествоУпаковок Тогда
			Таблица.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
			Для Каждого СтрокаТЧ Из Таблица Цикл
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.Количество;
			КонецЦикла;
		КонецЕсли;

		КоэффициентыПропорциональностиРасчетаЦенНаборов = НаборыСервер.КоэффициентыРаспределения(Таблица, Параметры);
		ДанныеПоКоличествуНаборов = КоличествоНаборов(Таблица);

		Наборы = КоэффициентыПропорциональностиРасчетаЦенНаборов.Скопировать();
		Наборы.Свернуть("НоменклатураНабора, ХарактеристикаНабора");
		Индекс = МаксимальныйИндексСтроки;
		Для Каждого Строка Из Наборы Цикл

			Индекс = Индекс + 1;

			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.НомерСтроки         = Индекс;
			НоваяСтрока.Номенклатура        = Строка.НоменклатураНабора;
			НоваяСтрока.Характеристика      = Строка.ХарактеристикаНабора;
			НоваяСтрока[ИмяКолонкиУпаковка] = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КонецЦикла;

		Таблица.Колонки.Удалить("Количество");
		Таблица.Колонки.Удалить("КоличествоУпаковок");

	КонецЕсли;

	Если ИспользуетсяЦенообразование25 И Не ЕстьСерия Тогда
		Таблица.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЕсли;

	// Получение запроса
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.ПустаяСсылка());

	ИменаКолонок = ИменаКолонокВременнойТаблицыТоваров();
	ИменаКолонок.ИмяКолонкиНомерСтроки = 	"НомерСтроки";
	ИменаКолонок.ИмяКолонкиСерия = 			"Серия";
	ИменаКолонок.ИмяКолонкиУпаковка = 		ИмяКолонкиУпаковка;

	Если ИспользуетсяЦенообразование25 Тогда
		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыТоваров2_5("", "втТаблицаТовары", ИменаКолонок);
	Иначе
		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыТоваров("", "втТаблицаТовары", ИменаКолонок);
	КонецЕсли;

	НеОчищатьПроизвольныеЦены = Ложь;
	Если ЗначениеЗаполнено(Параметры.ВидЦены) Тогда

		Запрос.УстановитьПараметр("ВидЦены", Параметры.ВидЦены);
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Если ИспользуетсяЦенообразование25 Тогда
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен2_5("втТаблицаЦены", "втТаблицаТовары", Истина);
		Иначе
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен("втТаблицаЦены", "втТаблицаТовары", Истина);
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаЦены.ВидЦены КАК ПолеВидЦеныНаЗамену,
		|	втТаблицаЦены.Цена КАК ПолеЦенаНаЗамену
		|ИЗ
		|	втТаблицаТовары КАК втТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЦены КАК втТаблицаЦены
		|		ПО (втТаблицаЦены.НомерСтроки = втТаблицаТовары.НомерСтроки)";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолеЦенаНаЗамену", Параметры.ПолеЦена);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолеВидЦеныНаЗамену", Параметры.ПолеВидЦены);

	ИначеЕсли ЗначениеЗаполнено(Параметры.Соглашение) Тогда

		НеОчищатьПроизвольныеЦены = ЕстьЦена И ЕстьВидЦены;

		Запрос.УстановитьПараметр("Соглашение", Параметры.Соглашение);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("НалогообложениеНДС", Параметры.НалогообложениеНДС);
		Запрос.УстановитьПараметр("ВозвращатьМногооборотнуюТару", Параметры.ВозвращатьМногооборотнуюТару);
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Если ИспользуетсяЦенообразование25 Тогда

			ВидыЦенСоглашения = ВидыЦенПартнера(Параметры.Соглашение);
			Если ВидыЦенСоглашения.Количество() = 0 Тогда
				Возврат ЦеныЗаполнены;
			КонецЕсли;

			Запрос.УстановитьПараметр("ВидыЦен", ВидыЦенСоглашения);
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению2_5("втТаблицаТовары");
		Иначе
#Удаление			
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");
#КонецУдаления
#Вставка
			если ПараметрыЗаполнения.Свойство("Подразделение") и значениезаполнено(ПараметрыЗаполнения.Подразделение) тогда
				Запрос.УстановитьПараметр("ФорматПодразделения", ПараметрыЗаполнения.Подразделение.ФорматПодразделения);
				Запрос.УстановитьПараметр("РегионПрисутствия", ПараметрыЗаполнения.Подразделение.РегионПрисутствия);
				Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению_НЦ("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");
			иначе	
				Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");	
			конецесли;
#КонецВставки  
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен("втТаблицаЦеныПоВидуЦен", "втТаблицаЦеныПоСоглашению", Ложь);
			Запрос.Текст = Запрос.Текст + "
			|;
			|ВЫБРАТЬ
			|	втТаблицаЦеныПоСоглашению.НомерСтроки КАК НомерСтроки,
			|	втТаблицаЦеныПоСоглашению.ВидЦены КАК ВидЦены,
			|	втТаблицаЦеныПоСоглашению.СтавкаНДС КАК СтавкаНДС,
			|	втТаблицаЦеныПоСоглашению.СрокПоставки КАК СрокПоставки,
			|	ВЫБОР
			|		КОГДА втТаблицаЦеныПоСоглашению.Цена = 0
			|			ТОГДА втТаблицаЦеныПоВидуЦен.Цена
			|		ИНАЧЕ втТаблицаЦеныПоСоглашению.Цена
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	втТаблицаЦеныПоСоглашению КАК втТаблицаЦеныПоСоглашению
			|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЦеныПоВидуЦен КАК втТаблицаЦеныПоВидуЦен
			|		ПО (втТаблицаЦеныПоВидуЦен.НомерСтроки = втТаблицаЦеныПоСоглашению.НомерСтроки)";
		КонецЕсли;

		УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(Запрос.Параметры, Параметры.Организация, Параметры.Дата);

	ИначеЕсли Параметры.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Партнер) И ИспользуетсяЦенообразование25 Тогда

		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		Запрос.УстановитьПараметр("Организация", ?(Параметры.Свойство("Организация"), Параметры.Организация, Справочники.Организации.ПустаяСсылка()));
		Запрос.УстановитьПараметр("НалогообложениеНДС", ?(Параметры.Свойство("НалогообложениеНДС"), Параметры.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка()));
		Запрос.УстановитьПараметр("ВозвращатьМногооборотнуюТару", ?(Параметры.Свойство("ВозвращатьМногооборотнуюТару"), Параметры.ВозвращатьМногооборотнуюТару, Ложь));
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоПартнеру2_5("втТаблицаТовары");
		ВидыЦенПартнера = ВидыЦенПартнера(Параметры.Партнер);
		Если ВидыЦенПартнера.Количество() = 0 Тогда
			Возврат ЦеныЗаполнены;
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидыЦен", ВидыЦенПартнера);

		УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(Запрос.Параметры, Параметры.Организация, Параметры.Дата);

	Иначе

		Возврат ЦеныЗаполнены;

	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	ОбрабатываемыеСтроки = Новый Массив;
	ОбрабатываемыеСтрокиСУчетомПогрешности = Новый Массив;
	Погрешности = Новый Соответствие();

	СтруктураЗаполнения = Новый Структура(Параметры.ПоляЗаполнения);
	ЕстьЗаполнениеЦены = СтруктураЗаполнения.Свойство("Цена");

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		// Расчет цен комплектующих набора
		Если Выборка.НомерСтроки > МаксимальныйИндексСтроки Тогда

			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки));
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			Отбор = Новый Структура;
			Отбор.Вставить("НоменклатураНабора", НайденныеСтроки[0].Номенклатура);
			Отбор.Вставить("ХарактеристикаНабора", НайденныеСтроки[0].Характеристика);

			НайденныеСтроки = КоэффициентыПропорциональностиРасчетаЦенНаборов.НайтиСтроки(Отбор); // Массив из СтрокаТабличнойЧасти

			КоличествоНаборов = 1;
			ДанныеПоКоличествуНаборовНайденныеСтроки = ДанныеПоКоличествуНаборов.НайтиСтроки(Отбор);
			Если ДанныеПоКоличествуНаборовНайденныеСтроки.Количество() > 0 Тогда
				КоличествоНаборов = ДанныеПоКоличествуНаборовНайденныеСтроки[0].КоличествоМинимум;
			КонецЕсли;

			ОбщаяСтоимость = 0;
			СуммаКРаспределению = Выборка.Цена * КоличествоНаборов;

			СлужебнаяТЧ = Новый ТаблицаЗначений;
			СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
			СлужебнаяТЧ.Колонки.Добавить("Количество");
			СлужебнаяТЧ.Колонки.Добавить("Стоимость");
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл

				СтрокаТЧ = ТабличнаяЧасть[ТекущаяСтрока.НомерСтроки - 1];

				Если ЕстьКодСтроки И СтрокаТЧ.КодСтроки <> 0 Тогда
					Продолжить;
				КонецЕсли;

				Стоимость = ТекущаяСтрока.Цена;
				Количество = ?(ЕстьКоличествоУпаковок, СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Количество);

				НоваяСтрока = СлужебнаяТЧ.Добавить();
				НоваяСтрока.СтрокаТЧ   = СтрокаТЧ;
				НоваяСтрока.Стоимость  = Стоимость;
				НоваяСтрока.Количество = Количество;

				ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;

			КонецЦикла;
			СлужебнаяТЧ.Сортировать("Количество УБЫВ");

			НомерСтроки = 0;
			КоличествоСтрок = СлужебнаяТЧ.Количество();
			Для Каждого ТекущаяСтрока Из СлужебнаяТЧ Цикл

				СтрокаТЧ = ТекущаяСтрока.СтрокаТЧ;
				Стоимость = ТекущаяСтрока.Стоимость;
				Количество = ТекущаяСтрока.Количество;

				НомерСтроки = НомерСтроки + 1;

				ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);

				Если Количество <> 0 И ОбщаяСтоимость <> 0 Тогда
					СтрокаТЧ.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению) / Количество, 2);
				Иначе
					СтрокаТЧ.Цена = 0;
				КонецЕсли;

				ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
				СуммаКРаспределению = СуммаКРаспределению - СтрокаТЧ.Цена * Количество;

				Погрешность = 0;
				Если НомерСтроки = КоличествоСтрок Тогда
					Погрешность = СуммаКРаспределению;
				КонецЕсли;

				Если СтруктураДействий <> Неопределено Тогда
					Погрешности.Вставить(СтрокаТЧ, Погрешность);
					ОбрабатываемыеСтрокиСУчетомПогрешности.Добавить(СтрокаТЧ);
				КонецЕсли;

			КонецЦикла;

		Иначе

			ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
			Если ТипЗнч(ТабличнаяЧасть) <> Тип("ТаблицаЗначений") Тогда
				СтрокаТЧ = ТабличнаяЧасть[Выборка.НомерСтроки - 1];
			Иначе
				НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки));
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаТЧ = НайденныеСтроки[0];
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			Если НеОчищатьПроизвольныеЦены И ЕстьЗаполнениеЦены
				И Не ЗначениеЗаполнено(Выборка.ВидЦены) И Не ЗначениеЗаполнено(Выборка.Цена)
				И Не ЗначениеЗаполнено(СтрокаТЧ.ВидЦены) И ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
				// Не подобралась цена. В ТЧ установлена произвольная. Не перезаполняем.
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);

			Если СтруктураДействий <> Неопределено Тогда
				ОбрабатываемыеСтроки.Добавить(СтрокаТЧ);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если СтруктураДействий <> Неопределено Тогда

		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		ТабличнаяЧасть,
		КэшированныеЗначения);

		Если ОбрабатываемыеСтрокиСУчетомПогрешности.Количество() Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомПогрешностиОкругления",
			Новый Структура("ПогрешностиПоСтрокам", Погрешности));

			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			ОбрабатываемыеСтрокиСУчетомПогрешности,
			СтруктураДействий,
			ТабличнаяЧасть,
			КэшированныеЗначения);
		КонецЕсли;

	КонецЕсли;

	Возврат Истина;

КонецФункции


#КонецОбласти
